openFoamSims/periodicHill/mlSim_classifier/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
288000
(
(0.0375 1.00637 0.0375)
(0.112501 1.0057 0.0375)
(0.187427 1.00104 0.0375)
(0.261854 0.988 0.0375)
(0.334808 0.963536 0.0375)
(0.405186 0.927589 0.0375)
(0.472592 0.883414 0.0375)
(0.537405 0.834459 0.0375)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
7200
(
(0.0375 3.035 0.0375)
(0.0375 3.035 0.1125)
(0.0375 3.035 0.1875)
(0.0375 3.035 0.2625)
(0.0375 3.035 0.3375)
(0.0375 3.035 0.4125)
(0.0375 3.035 0.4875)
(0.0375 3.035 0.5625)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<vector> 
7200
(
(0.0375 1 0.0375)
(0.0375 1 0.1125)
(0.0375 1 0.1875)
(0.0375 1 0.2625)
(0.0375 1 0.3375)
(0.0375 1 0.4125)
(0.0375 1 0.4875)
(0.0375 1 0.5625)
...
)
;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
