openFoamSims/periodicHill/mlSim_classifier/constant/zonesGenerator
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: 13                                    |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      zonesGenerator;
}

all
{
    type        box;
    zoneType    cell;
    moveUpdate  false;

    box (-10 -10 -10) (10 10 10);
}