openFoamSims/periodicHill/mlSim_classifier/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// ------------------------------------------------------------------------- //
// Geometry
//
// x = 0 ... 9h
// y = hill ... 3.035h
// z = 0 ... 4.5h
//
// h = 28 mm
// scale = 1 because geometry is already normalized by h.
// ------------------------------------------------------------------------- //

scale 1;


// ------------------------------------------------------------------------- //
// Vertices
//
// There are NLAYERS+1 streamwise curves.
// Each curve has two vertices at x=0 and x=9.
// The same curves are duplicated at z=4.5.
//
// Layer 0 = hill wall
// Layer NLAYERS = channel top
// ------------------------------------------------------------------------- //

vertices
(
    // layer 0: wall
    (0   1.000000  0)      // 0
    (9   1.000000  0)      // 1

    // layer 1
    (0   1.040000  0)      // 2
    (9   1.040000  0)      // 3

    // layer 2
    (0   1.100000  0)      // 4
    (9   1.100000  0)      // 5

    // layer 3
    (0   1.200000  0)      // 6
    (9   1.200000  0)      // 7

    // layer 4
    (0   1.400000  0)      // 8
    (9   1.400000  0)      // 9

    // layer 5
    (0   1.700000  0)      // 10
    (9   1.700000  0)      // 11

    // layer 6
    (0   2.100000  0)      // 12
    (9   2.100000  0)      // 13

    // layer 7
    (0   2.550000  0)      // 14
    (9   2.550000  0)      // 15

    // layer 8: top
    (0   3.035000  0)      // 16
    (9   3.035000  0)      // 17


    // z = 4.5
    (0   1.000000  4.5)     // 18
    (9   1.000000  4.5)     // 19

    (0   1.040000  4.5)     // 20
    (9   1.040000  4.5)     // 21

    (0   1.100000  4.5)     // 22
    (9   1.100000  4.5)     // 23

    (0   1.200000  4.5)     // 24
    (9   1.200000  4.5)     // 25

    (0   1.400000  4.5)     // 26
    (9   1.400000  4.5)     // 27

    (0   1.700000  4.5)     // 28
    (9   1.700000  4.5)     // 29

    (0   2.100000  4.5)     // 30
    (9   2.100000  4.5)     // 31

    (0   2.550000  4.5)     // 32
    (9   2.550000  4.5)     // 33

    (0   3.035000  4.5)     // 34
    (9   3.035000  4.5)     // 35
);


// ------------------------------------------------------------------------- //
// Structured blocks
// ------------------------------------------------------------------------- //

blocks
(
    hex (0  1  3  2   18 19 21 20)   (120 8 60)
        simpleGrading (1 1 1)

    hex (2  3  5  4   20 21 23 22)   (120 8 60)
        simpleGrading (1 1 1)

    hex (4  5  7  6   22 23 25 24)   (120 8 60)
        simpleGrading (1 1 1)

    hex (6  7  9  8   24 25 27 26)   (120 8 60)
        simpleGrading (1 1 1)

    hex (8  9 11 10   26 27 29 28)   (120 8 60)
        simpleGrading (1 1 1)

    hex (10 11 13 12   28 29 31 30)  (120 8 60)
        simpleGrading (1 1 1)

    hex (12 13 15 14   30 31 33 32)  (120 8 60)
        simpleGrading (1 1 1)

    hex (14 15 17 16   32 33 35 34)  (120 8 60)
        simpleGrading (1 1 1)
);


// ------------------------------------------------------------------------- //
// Curved streamwise edges
//
// Each layer is constructed from the hill profile:
//
//      y_layer = y_wall + eta*(3.035 - y_wall)
//
// This makes all layers follow the hill.
// ------------------------------------------------------------------------- //

edges #codeStream
{
    codeInclude
    #{
        #include "pointField.H"
        #include "mathematicalConstants.H"
    #};

    code
    #{

        os << "(" << nl;


        // ---------------------------------------------------------------
        // Geometry
        // ---------------------------------------------------------------

        const scalar h = 28.0;

        const scalar xMin = 0.0;
        const scalar xMax = 252.0;

        const label nPoints = 1500;

        const scalar dx =
            (xMax - xMin)/scalar(nPoints - 1);

        const scalar yTop = 3.035;


        // ---------------------------------------------------------------
        // Wall-normal locations
        //
        // eta = 0 -> wall
        // eta = 1 -> top
        //
        // These are fractions of the LOCAL NORMAL DISTANCE to the top.
        // ---------------------------------------------------------------

        const scalar eta[9] =
        {
            0.00,
            0.005,
            0.015,
            0.030,
            0.060,
            0.12,
            0.25,
            0.50,
            1.00
        };


        // ---------------------------------------------------------------
        // Periodic hill wall position.
        //
        // Input: x in mm
        // Output: y in mm
        // ---------------------------------------------------------------

        auto wallY =
        [&](const scalar xInput) -> scalar
        {
            scalar x = xInput;

            // Periodic wrapping
            while (x < 0.0)
            {
                x += 252.0;
            }

            while (x > 252.0)
            {
                x -= 252.0;
            }


            scalar xs = x;

            if (xs > 198.0)
            {
                xs = 252.0 - xs;
            }


            scalar y = 0.0;


            if (xs >= 0.0 && xs < 9.0)
            {
                y =
                    28.0
                  + 0.000000000000E+00*xs
                  + 6.775070969851E-03*xs*xs
                  - 2.124527775800E-03*xs*xs*xs;

                y = min(28.0, y);
            }
            else if (xs >= 9.0 && xs < 14.0)
            {
                y =
                    2.507355893131E+01
                  + 9.754803562315E-01*xs
                  - 1.016116352781E-01*xs*xs
                  + 1.889794677828E-03*xs*xs*xs;
            }
            else if (xs >= 14.0 && xs < 20.0)
            {
                y =
                    2.579601052357E+01
                  + 8.206693007457E-01*xs
                  - 9.055370274339E-02*xs*xs
                  + 1.626510569859E-03*xs*xs*xs;
            }
            else if (xs >= 20.0 && xs < 30.0)
            {
                y =
                    4.046435022819E+01
                  - 1.379581654948E+00*xs
                  + 1.945884504128E-02*xs*xs
                  - 2.070318932190E-04*xs*xs*xs;
            }
            else if (xs >= 30.0 && xs < 40.0)
            {
                y =
                    1.792461334664E+01
                  + 8.743920332081E-01*xs
                  - 5.567361123058E-02*xs*xs
                  + 6.277731764683E-04*xs*xs*xs;
            }
            else if (xs >= 40.0 && xs < 54.0)
            {
                y =
                    5.639011190988E+01
                  - 2.010520359035E+00*xs
                  + 1.644919857549E-02*xs*xs
                  + 2.674976141766E-05*xs*xs*xs;

                y = max(0.0, y);
            }
            else
            {
                y = 0.0;
            }

            return y;
        };


        // ---------------------------------------------------------------
        // Generate all curved edges.
        // ---------------------------------------------------------------

        for (label layer = 0; layer < 9; ++layer)
        {
            pointField profile(nPoints);


            for (label i = 0; i < nPoints; ++i)
            {
                const scalar xmm =
                    xMin + i*dx;


                // -------------------------------------------------------
                // Wall location
                // -------------------------------------------------------

                const scalar yWallMM =
                    wallY(xmm);


                const scalar xh =
                    xmm/h;

                const scalar yWall =
                    yWallMM/h;


                // -------------------------------------------------------
                // Compute wall slope dy/dx.
                //
                // Numerical derivative is used so the same hill
                // function defines both position and normal.
                // -------------------------------------------------------

                const scalar delta =
                    1.0e-3;


                const scalar yPlus =
                    wallY(xmm + delta);

                const scalar yMinus =
                    wallY(xmm - delta);


                const scalar dydx_mm =
                    (yPlus - yMinus)/(2.0*delta);


                // dy/dx is unchanged by the mm -> h normalization


                // -------------------------------------------------------
                // Unit normal pointing into the flow
                //
                // tangent = (1, dydx)
                //
                // normal  = (-dydx, 1)
                // -------------------------------------------------------

                const scalar magNormal =
                    sqrt(1.0 + sqr(dydx_mm));


                const scalar nx =
                    -dydx_mm/magNormal;

                const scalar ny =
                     1.0/magNormal;


                // -------------------------------------------------------
                // Distance along the normal until it intersects
                // the horizontal upper wall y = 3.035.
                //
                // yWall + d*ny = yTop
                //
                // therefore:
                //
                // d = (yTop-yWall)/ny
                // -------------------------------------------------------

                const scalar dTop =
                    (yTop - yWall)/ny;


                // -------------------------------------------------------
                // Move from wall along the NORMAL.
                //
                // eta = 0 -> wall
                // eta = 1 -> top
                // -------------------------------------------------------

                const scalar d =
                    eta[layer]*dTop;


                const scalar xLayer =
                    xh + d*nx/h;

                const scalar yLayer =
                    yWall + d*ny;


                profile[i].x() = xLayer;
                profile[i].y() = yLayer;
                profile[i].z() = 0.0;
            }


            // -----------------------------------------------------------
            // z = 0 curved edge
            // -----------------------------------------------------------

            const label v0 = 2*layer;
            const label v1 = 2*layer + 1;


            os
                << "spline "
                << v0
                << " "
                << v1
                << nl;

            os << profile << nl;


            // -----------------------------------------------------------
            // z = 4.5 curved edge
            // -----------------------------------------------------------

            const label v0z = 18 + 2*layer;
            const label v1z = 18 + 2*layer + 1;


            os
                << "spline "
                << v0z
                << " "
                << v1z
                << nl;


            profile.replace(2, 4.5);

            os << profile << nl;
        }


        os << ");" << nl;

    #};
};

// ------------------------------------------------------------------------- //
// Boundary conditions
// ------------------------------------------------------------------------- //

boundary
(
    inlet
    {
        type cyclic;
        neighbourPatch outlet;

        faces
        (
            (0 18 20 2)
        );
    }


    outlet
    {
        type cyclic;
        neighbourPatch inlet;

        faces
        (
            (1 3 21 19)
        );
    }


    top
    {
        type wall;

        faces
        (
            (16 34 35 17)
        );
    }


    hills
    {
        type wall;

        faces
        (
            (0 1 19 18)
        );
    }


    front
    {
        type cyclic;
        neighbourPatch back;

        faces
        (
            (0 2 3 1)
            (2 4 5 3)
            (4 6 7 5)
            (6 8 9 7)
            (8 10 11 9)
            (10 12 13 11)
            (12 14 15 13)
            (14 16 17 15)
        );
    }


    back
    {
        type cyclic;
        neighbourPatch front;

        faces
        (
            (18 19 21 20)
            (20 21 23 22)
            (22 23 25 24)
            (24 25 27 26)
            (26 27 29 28)
            (28 29 31 30)
            (30 31 33 32)
            (32 33 35 34)
        );
    }
);


mergePatchPairs
(
);


// ************************************************************************* //